pengnianchun/Fangyan-dspic30f6012A-299/友谊客车-上海瑞华/20180423-1T3-NewSystem/YouYiKeChe-PIC299-ShangHaiRuiHua/Pic299Base/src/test/TEST/LED_main.c
/*
 * File:   LED_main.c
 * Author: mpszm
 *
 * Created on 2016年8月4日, 上午9:45
 */
// FOSC
#pragma config FOSFPR = XT_PLL4         // Oscillator (XT w/PLL 4x)
#pragma config FCKSMEN = CSW_FSCM_OFF   // Clock Switching and Monitor (Sw Disabled, Mon Disabled)

// FWDT
#pragma config FWPSB = WDTPSB_16        // WDT Prescaler B (1:16)
#pragma config FWPSA = WDTPSA_512       // WDT Prescaler A (1:512)
#pragma config WDT = WDT_OFF            // Watchdog Timer (Disabled)

// FBORPOR
#pragma config FPWRT = PWRT_64          // POR Timer Value (64ms)
#pragma config BODENV = NONE            // Brown Out Voltage (Reserved)
#pragma config BOREN = PBOR_ON          // PBOR Enable (Enabled)
#pragma config MCLRE = MCLR_EN          // Master Clear Enable (Enabled)

// FBS
#pragma config BWRP = WR_PROTECT_BOOT_OFF// Boot Segment Program Memory Write Protect (Boot Segment Program Memory may be written)
#pragma config BSS = NO_BOOT_CODE       // Boot Segment Program Flash Memory Code Protection (No Boot Segment)
#pragma config EBS = NO_BOOT_EEPROM     // Boot Segment Data EEPROM Protection (No Boot EEPROM)
#pragma config RBS = NO_BOOT_RAM        // Boot Segment Data RAM Protection (No Boot RAM)

// FSS
#pragma config SWRP = WR_PROT_SEC_OFF   // Secure Segment Program Write Protect (Disabled)
#pragma config SSS = NO_SEC_CODE        // Secure Segment Program Flash Memory Code Protection (No Secure Segment)
#pragma config ESS = NO_SEC_EEPROM      // Secure Segment Data EEPROM Protection (No Segment Data EEPROM)
#pragma config RSS = NO_SEC_RAM         // Secure Segment Data RAM Protection (No Secure RAM)

// FGS
#pragma config GWRP = GWRP_OFF          // General Code Segment Write Protect (Disabled)
#pragma config GCP = GSS_OFF            // General Segment Code Protection (Disabled)

// FICD
#pragma config ICS = ICS_PGD            // Comm Channel Select (Use PGC/EMUC and PGD/EMUD)

#include <xc.h>
#include "bsp.h"

int main(void) {
    BL_Init();
    
    while (1) {
        OC1RS=0;
        alarm_led[0].byte = 0x00;
        alarm_led[1].byte = 0x00;
        alarm_led[2].byte = 0x00;
        alarm_led[3].byte = 0x00;
        LED_Out();
        __delay_ms(2000);
        OC1RS=1000;
        alarm_led[0].byte = 0xff;
        alarm_led[1].byte = 0xff;
        alarm_led[2].byte = 0xff;
        alarm_led[3].byte = 0xff;
        LED_Out();
        __delay_ms(2000);
        
        DS3231_SetTime(&timer);
        __delay_ms(2000);
        DS3231_ReadTime(&timer);
    }
    return 0;
}
